**`teams/delius-core/oracle_db`** terragrunt plan on `pull_request` event [#152](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-core-ol-8-5-oracle-db-19c"
        name         = "delius_core_ol_8_5_oracle_db_19c"
      ~ tags         = {
            "application"                  = "DELIUS-CORE"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            "is-production"                = "true"
            "os-version"                   = "oracle linux 8.5"
            "owner"                        = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"             = "patch"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      ~ tags_all     = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-core-ol-8-5-oracle-db-19c" -> (known after apply)
      ~ date_created                     = "2023-10-31T16:13:14.358Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      ~ date_next_run                    = "2023-12-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-10-31T16:13:14.358Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-core-ol-8-5-oracle-db-19c" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-core-ol-8-5-oracle-db-19c/0.0.8" # forces replacement -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-core-ol-8-5-oracle-db-19c-0-0-8" -> (known after apply)
        name                             = "delius_core_ol_8_5_oracle_db_19c"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
            "application"                  = "DELIUS-CORE"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            "is-production"                = "true"
            "os-version"                   = "oracle linux 8.5"
            "owner"                        = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"             = "patch"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      ~ tags_all                         = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          ~ pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE" -> "EXPRESSION_MATCH_ONLY"
          + timezone                           = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-core-ol-8-5-oracle-db-19c/0.0.8" -> (known after apply)
      ~ date_created     = "2023-10-31T16:13:12.985Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-core-ol-8-5-oracle-db-19c/0.0.8" -> (known after apply)
        name             = "delius_core_ol_8_5_oracle_db_19c"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
            "application"                  = "DELIUS-CORE"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            "is-production"                = "true"
            "os-version"                   = "oracle linux 8.5"
            "owner"                        = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"             = "patch"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      ~ tags_all         = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            # (9 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.8" -> "0.0.9" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-core-ol-8-5-oracle-db-19c-0-0-8" -> (known after apply)
      ~ date_created                  = "2023-10-31T16:13:13.357Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-core-ol-8-5-oracle-db-19c-0-0-8" -> (known after apply)
      ~ name                          = "delius_core_ol_8_5_oracle_db_19c_0_0_8" -> "delius_core_ol_8_5_oracle_db_19c_0_0_9" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            # (9 unchanged elements hidden)
        }
      ~ tags                          = {
            "application"                  = "DELIUS-CORE"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "delius_core_ol_8_5_oracle_db_19c"
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            "is-production"                = "true"
            "os-version"                   = "oracle linux 8.5"
            "owner"                        = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"             = "patch"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      ~ tags_all                      = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.8" -> "delius_core_ol_8_5_oracle_db_19c/0.0.9"
            # (9 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
